---
kind: method
id: M:Autodesk.Revit.DB.TableCellCalculatedValueData.Dispose
source: html/b3da2ef1-48ef-5db6-1701-3e1ab5e168cd.htm
---
# Autodesk.Revit.DB.TableCellCalculatedValueData.Dispose Method

Releases all resources used by the TableCellCalculatedValueData

## Syntax (C#)
```csharp
public void Dispose()
```